# RebarShapeConstraintChordLength Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarShapeConstraintChordLength Class
Members See Also
---
A constraint that can be applied to a RebarShapeDefinitionByArc and drives the straight distance between the arc endpoints.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public class RebarShapeConstraintChordLength : RebarShapeConstraint
```

Visual Basic
---
```text
Public Class RebarShapeConstraintChordLength _
	Inherits RebarShapeConstraint
```

Visual C++
---
```text
public ref class RebarShapeConstraintChordLength : public RebarShapeConstraint
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure..::..RebarShapeConstraint Autodesk.Revit.DB.Structure..::..RebarShapeConstraintChordLength
# See Also
RebarShapeConstraintChordLength Members
Autodesk.Revit.DB.Structure Namespace